hp-ux-trust-issue.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>hp-ux-trust-issue</title>
<!-- 2017-05-28 일 22:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">hp-ux-trust-issue</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Trusted System 소개</a></li>
<li><a href="#sec-2">2. Trusted System으로 변경 방법</a>
<ul>
<li><a href="#sec-2-1">2.1. 주의</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. 변경 작업시 실패하면 시스템으로 로그인 불가합니다.</a></li>
<li><a href="#sec-2-1-2">2.1.2. root 계정이 잠기는 경우를 대비해서 shutdown 권한이 있는 별도의 계정의 생성을 권고합니다.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. Standard System으로 변경 방법</a></li>
<li><a href="#sec-4">4. 이슈 (Appendix A Trusted Systems)</a>
<ul>
<li><a href="#sec-4-1">4.1. 개별 계정에 대해서 audit ID를 추가로 생성한다.</a></li>
<li><a href="#sec-4-2">4.2. audit flag를 활성화 한다.</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. 주의</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. 관리자의 패스워드 저장소 관리 지점 변경</a></li>
<li><a href="#sec-4-4">4.4. backup 및 restore 정상 여부 확인</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1. fbackup과 frecover를 사용하기를 권고합니다.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. 참고문서</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Trusted System 소개</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>HP-UX는 기본적으로 Standard Mode에서 운용된다.
</li>
<li>Trusted System으로 변경 과정을 거쳐 Trusted Mode로 운용된다.
</li>
<li>확장된 패스워드 정책 기능과 감사 기능을 제공한다.
</li>
<li>기본적인 패스워드 정책 기능은 SMSE(Standard Mode Security Extensions)으로 가능하다.
</li>
<li>감사 기능은 개별적으로 활성화 가능하다.  
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Trusted System으로 변경 방법</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>HP SMH &gt; System Security Policies &gt; Convert to trusted system &gt; Y
</li>
<li>/usr/lbin/tsconvert
</li>
</ul>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 주의</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> 변경 작업시 실패하면 시스템으로 로그인 불가합니다.</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>별도의 창에서 로그인을 해두고 작업을 하기를 권고합니다.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> root 계정이 잠기는 경우를 대비해서 shutdown 권한이 있는 별도의 계정의 생성을 권고합니다.</h4>
<div class="outline-text-4" id="text-2-1-2">
<ol class="org-ol">
<li>별도의 계정을 통해서 시스템을 정상적으로 재기동
</li>
<li>싱글유저 모드에서 root 계정 초기화 시도
</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Standard System으로 변경 방법</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>/usr/lbin/tsconvert -r
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 이슈 (Appendix A Trusted Systems)</h2>
<div class="outline-text-2" id="text-4">
<p>
Trusted System으로 변경 작업 이 후의 이슈 사항을 정리하였습니다.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 개별 계정에 대해서 audit ID를 추가로 생성한다.</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>at, batch, crontab에 영향을 끼치는 것으로 되어 있다.
</li>
<li>Trusted Mode로 변경 이후 배치 작업 수행여부 확인이 필요합니다.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> audit flag를 활성화 한다.</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>패스워드 정책 기능의 즉각적인 활성화처럼 auditing 기능의 활성화 여부의 확인이 필요합니다.
</li>
</ul>
</div>

<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> 주의</h4>
<div class="outline-text-4" id="text-4-2-1">
</div><ol class="org-ol"><li><a id="sec-4-2-1-1" name="sec-4-2-1-1"></a>시스템의 특성에 따라서 시스템 부하 증가합니다.<br  /></li>

<li><a id="sec-4-2-1-2" name="sec-4-2-1-2"></a>audit file은 root 파일시스템에 저장되면 안됩니다.<br  /><div class="outline-text-5" id="text-4-2-1-2">
<ul class="org-ul">
<li>root 파일시스템이 가득차는 경우 프로세스 수행 실패 및 hang이 발생합니다.
</li>
</ul>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 관리자의 패스워드 저장소 관리 지점 변경</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>변경전에는 /etc/passwd 그리고 추가적으로 /etc/shadow를 관리하였다.
</li>
<li>/tcb/files/auth의 개별 디렉토리에 계정정보가 저장된다.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> backup 및 restore 정상 여부 확인</h3>
<div class="outline-text-3" id="text-4-4">
</div><div id="outline-container-sec-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> fbackup과 frecover를 사용하기를 권고합니다.</h4>
<div class="outline-text-4" id="text-4-4-1">
<ul class="org-ul">
<li>운용중인 백업 소프트웨어가 trusted mode에서 정상 운용가능한지 확인이 필요합니다.
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 참고문서</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>HP-UX System Administration Guide: Security Management, HP-UX 11i Version 3
</li>
<li><a href="https://docstore.mik.ua/manuals/hp-ux/en/5992-3387/apa.html">https://docstore.mik.ua/manuals/hp-ux/en/5992-3387/apa.html</a>
</li>
</ul>

<p>
&#x2013; 
(주)와이엘아이티 태영춘 과장
서울특별시 영등포구 선유로 88 701호(양평동1가, 윤당제1빌딩) (우)07291
TEL : 070-8702-3205
FAX : 02-862-3205
Mobile : 010-8638-0950
E-mail : yctae@ylit.co.kr, taeyoungchoon@gmail.com
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-05-28 일 22:08</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
